## :white_check_mark: Apply Result (terraform/container_registry)

[CI link](https://github.com/nakashima-yuta23-fixer/github_actions_triger_terraform/actions/runs/10765692355)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.container_registry.azurerm_container_registry.this: Refreshing state... [id=/subscriptions/db9f0eac-7ae4-4b1e-aeb9-7455410c8395/resourceGroups/rg-nytes1-dev-je/providers/Microsoft.ContainerRegistry/registries/acrnytes1dvje]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.container_registry.azurerm_container_registry.this must be replaced
-/+ resource "azurerm_container_registry" "this" {
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      ~ encryption                    = [
          - {
              - enabled            = false
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ id                            = "/subscriptions/db9f0eac-7ae4-4b1e-aeb9-7455410c8395/resourceGroups/rg-nytes1-dev-je/providers/Microsoft.ContainerRegistry/registries/acrnytes1dvje" -> (known after apply)
      ~ login_server                  = "acrnytes1dvje.azurecr.io" -> (known after apply)
      ~ name                          = "acrnytes1dvje" -> "acrnytes1devje" # forces replacement
      ~ network_rule_set              = [] -> (known after apply)
      - quarantine_policy_enabled     = false -> null
      ~ retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> (known after apply)
      - tags                          = {} -> null
      ~ trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
module.container_registry.azurerm_container_registry.this: Destroying... [id=/subscriptions/db9f0eac-7ae4-4b1e-aeb9-7455410c8395/resourceGroups/rg-nytes1-dev-je/providers/Microsoft.ContainerRegistry/registries/acrnytes1dvje]
module.container_registry.azurerm_container_registry.this: Still destroying... [id=/subscriptions/db9f0eac-7ae4-4b1e-aeb9-...ainerRegistry/registries/acrnytes1dvje, 10s elapsed]
module.container_registry.azurerm_container_registry.this: Destruction complete after 19s
module.container_registry.azurerm_container_registry.this: Creating...
module.container_registry.azurerm_container_registry.this: Still creating... [10s elapsed]
module.container_registry.azurerm_container_registry.this: Still creating... [20s elapsed]
module.container_registry.azurerm_container_registry.this: Creation complete after 25s [id=/subscriptions/db9f0eac-7ae4-4b1e-aeb9-7455410c8395/resourceGroups/rg-nytes1-dev-je/providers/Microsoft.ContainerRegistry/registries/acrnytes1devje]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

```

</details>



<!-- github-comment: {"Command":"apply","JobName":"merge-trigger","PRNumber":8,"Program":"tfcmt","SHA1":"2e8214026887f38e666188de592aad6fd8b21f97","Target":"terraform/container_registry","Vars":{},"WorkflowName":"Merge trigger"} -->